# -*- coding: utf-8 -*-

"""
6.3.2.(2).Jacobi 반복법
"""
x1 = 0
x2 = 0
x3 = 0

x11 = (-7-x2-2*x3)/4
x21 = (1-4*x1-2*x3)/9
x31 = (-13-2*x1-5*x2)/8
print(x11)
print(x21)
print(x31)

x12 = (-7-x21-2*x31)/4
x22 = (1-4*x11-2*x31)/9
x32 = (-13-2*x11-5*x21)/8
print(x12)
print(x22)
print(x32)

x13 = (-7-x22-2*x32)/4
x23 = (1-4*x12-2*x32)/9
x33 = (-13-2*x12-5*x22)/8
print(x13)
print(x23)
print(x33)

x14 = (-7-x23-2*x33)/4
x24 = (1-4*x13-2*x33)/9
x34 = (-13-2*x13-5*x23)/8
print(x14)
print(x24)
print(x34)

x15 = (-7-x24-2*x34)/4
x25 = (1-4*x14-2*x34)/9
x35 = (-13-2*x14-5*x24)/8
print(x15)
print(x25)
print(x35)

x16 = (-7-x25-2*x35)/4
x26 = (1-4*x15-2*x35)/9
x36 = (-13-2*x15-5*x25)/8
print(x16)
print(x26)
print(x36)

x17 = (-7-x26-2*x36)/4
x27 = (1-4*x16-2*x36)/9
x37 = (-13-2*x16-5*x26)/8
print(x17)
print(x27)
print(x37)

x18 = (-7-x27-2*x37)/4
x28 = (1-4*x17-2*x37)/9
x38 = (-13-2*x17-5*x27)/8
print(x18)
print(x28)
print(x38)

x19 = (-7-x28-2*x38)/4
x29 = (1-4*x18-2*x38)/9
x39 = (-13-2*x18-5*x28)/8
print(x19)
print(x29)
print(x39)

x110 = (-7-x29-2*x39)/4
x210 = (1-4*x19-2*x39)/9
x310 = (-13-2*x19-5*x29)/8
print(x110)
print(x210)
print(x310)



e1 = max(abs(-1-x11), abs(1-x21), abs(-2-x31))
e2 = max(abs(-1-x12), abs(1-x22), abs(-2-x32))
e3 = max(abs(-1-x13), abs(1-x23), abs(-2-x33))
e4 = max(abs(-1-x14), abs(1-x24), abs(-2-x34))
e5 = max(abs(-1-x15), abs(1-x25), abs(-2-x35))
e6 = max(abs(-1-x16), abs(1-x26), abs(-2-x36))
e7 = max(abs(-1-x17), abs(1-x27), abs(-2-x37))
e8 = max(abs(-1-x18), abs(1-x28), abs(-2-x38))
e9 = max(abs(-1-x19), abs(1-x29), abs(-2-x39))
e10 = max(abs(-1-x110), abs(1-x210), abs(-2-x310))

print(e1)
print(e2)
print(e3)
print(e4)
print(e5)
print(e6)
print(e7)
print(e8)
print(e9)
print(e10)

e1/2
e2/e1
e3/e2
e4/e3
e5/e4
e6/e5
e7/e6
e8/e7
e9/e8
e10/e9


"""
6.3.2.(2).Gauss-Seidel 반복법
"""
y1 = 0
y2 = 0
y3 = 0

for i in range(1,11) :
    y1 = (-7-y2-2*y3)/4
    y2 = (1-4*y1-2*y3)/9
    y3 = (-13-2*y1-5*y2)/8
    print(y1)
    print(y2)
    print(y3)
    print(" ")

y11 = -1.75
y21 = 0.8888888888888888
y31 = -1.7430555555555556
 
y12 = -1.1006944444444446
y22 = 0.9876543209876544
y32 = -1.9671103395061729
 
y13 = -1.0133584104938271
y23 = 0.9986282578875172
y33 = -1.9958030585562414
 
y14 = -1.0017555351937588
y24 = 0.9998475842097242
y34 = -1.999465856332638
 
y15 = -1.000228967886112
y25 = 0.9999830649121917
y35 = -1.9999321735985918
 
y16 = -1.000029679428752
y26 = 0.9999981183235769
y36 = -1.9999914040950475
 
y17 = -1.0000038275333702
y27 = 0.9999997909248418
y37 = -1.9999989124446835
 
y18 = -1.0000004915088687
y28 = 0.999999976769427
y38 = -1.9999998626036746
 
y19 = -1.0000000628905195
y29 = 0.9999999974188252
y39 = -1.999999982664136
 
y110 = -1.0000000080226386
y210 = 0.9999999997132029
y310 = -1.9999999978150922


ee1 = max(abs(-1-y11), abs(1-y21), abs(-2-y31))
ee2 = max(abs(-1-y12), abs(1-y22), abs(-2-y32))
ee3 = max(abs(-1-y13), abs(1-y23), abs(-2-y33))
ee4 = max(abs(-1-y14), abs(1-y24), abs(-2-y34))
ee5 = max(abs(-1-y15), abs(1-y25), abs(-2-y35))
ee6 = max(abs(-1-y16), abs(1-y26), abs(-2-y36))
ee7 = max(abs(-1-y17), abs(1-y27), abs(-2-y37))
ee8 = max(abs(-1-y18), abs(1-y28), abs(-2-y38))
ee9 = max(abs(-1-y19), abs(1-y29), abs(-2-y39))
ee10 = max(abs(-1-y110), abs(1-y210), abs(-2-y310))

print(ee1)
print(ee2)
print(ee3)
print(ee4)
print(ee5)
print(ee6)
print(ee7)
print(ee8)
print(ee9)
print(ee10)

ee1/2
ee2/ee1
ee3/ee2
ee4/ee3
ee5/ee4
ee6/ee5
ee7/ee6
ee8/ee7
ee9/ee8
ee10/ee9






